// 5. Доорх кодыг туршиж үр дүнг тайлабарлан бичнэ үү.
// char *p1;
// int *p2;
// double *p3;
// cout<<sizeof(p1)<<endl<<sizeof(p2)<<endl<<sizeof(p3); //хэд хэд
// гэсэн утга хэвлэж байна вэ? Яагаад?

#include <iostream>

using namespace std;

int main()
{
    char *p1;
    int *p2;
    double *p3;
    cout << sizeof(p1) << endl
         << sizeof(p2) << endl
         << sizeof(p3);
    return 0;
}

// Хариулт:
// Дээрх код нь гурван өөр төрлийн заагч хувьсагчийн хэмжээг шалгаж байна. Үүнд:
// 1. char *p1: char төрлийн заагч хувьсагчийн хэмжээ
// 2. int *p2: int төрлийн хувьсагчийн хэмжээ
// 3. double *p3: double төрлийн хувьсагчийн хэмжээ
// 64 byte OS-тэй тул бүгд ижилхэн 8 гэсэн утга хэвлэнэ. Учир нь заатан хувьсагчийн хэмжээ нь
// тухайн системийн OS-ийн хэмжээнээс хамаардаг бөгөөл 64 битийн системд заалтан хувьсагчийн хэмжээ
// 8 байт байдаг.